# Install this file by running $ brew bundle
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"

# Command line apps
brew "autojump"
brew "neovim"
brew "nvm"
brew "jq"
brew "lf"
brew "gradle"
brew "gradle@7"
brew "gradle@6"
brew "openjdk@11"
brew "go"
brew "podman"
brew "ripgrep"
brew "tmux"
brew "yabai"
brew "skhd"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Helix LSPs
brew "helix"
brew "jdtls"
brew "gopls"
brew "dlv"
brew "marksman"
brew "bash-language-server"
brew "yaml-language-server"
brew "docker-ls"


# Gui apps
cask "alacritty"
cask "wezterm"
cask "firefox"
cask "font-fira-code-nerd-font"
#cask "google-chrome"
