# Install this file by running $ brew bundle
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "FelixKratz/formulae"

# Command line apps
#

brew "neovim"
brew "jq"
brew "lf"
brew "go"
brew "podman"
brew "ripgrep"
brew "tmux"
brew "zellij"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Bluefin recommended tools
brew "atuin"
brew "bat"
brew "direnv"
brew "dysk"
brew "eza"
brew "fd"
brew "gh"
brew "glab"
brew "rg"
brew "shellcheck"
brew "tealdeer"
brew "ugrep"
brew "yq"
brew "zoxide"

# work dev tools
brew "gradle"
brew "gradle@7"
brew "gradle@6"
brew "openjdk@11"
brew "nvm"

# Helix LSPs
brew "helix"
brew "jdtls"
brew "gopls"
brew "dlv"
brew "marksman"
brew "bash-language-server"
brew "yaml-language-server"
brew "docker-ls"

# Jekyll
brew "chruby"
brew "ruby-install"

# Mac only
brew "borders"
cask "nikitabobko/tap/aerospace"

# Gui apps
cask "wezterm"
cask "firefox"
cask "font-fira-code-nerd-font"
#cask "google-chrome"
